const animesFour = [
    {
        id: 49,
        name: "Один на вылет", 
        url: "/anime/departure",
        release: {
            day: 1,
            month: 10,
            year: 2008,
        },
        seasons: 1,
        series: 25,
        isComing: false,
        genres: [
            {
                name: "спорт",
                url: "/genres/sport"
            }, 
        ],
        author: "Синобу Кайтани",
        texts: {
            plot: "Хиромичи Коджима он ведущий бэттер в профессиональной команде бейсболистов. Его верный питчер Наканэ и тренер устроили тренировочный лагерь на Акинаве. С тех пор как Коджима 21 год назад присоединился к Лекоонсу, он завоевал звание — новичок года. Но за всю карьеру бейсболиста Коджима ни разу не выиграл ни одного чемпионата, из-за чего остальные его считают невезучим гением бэттера. Для победы ему не хватает какого-то недостающего звена, и организованный лагерь был чтобы найти его. И именно здесь Коджима встретит именно его — Тоа Токучи — гений питчер.Кадры" 
        }
    },
    {
        id: 50,
        name: "Демоны старшый школы", 
        url: "/anime/older",
        release: {
            day: 6,
            month: 9,
            year: 2012,
        },
        seasons: 4,
        series: 52,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            }
        ],
        author: "Итиэй Исибуми",
        texts: {
            plot: "Согласно сюжету ранобэ, демоны с древних времен сражались за контроль над Подземным миром с изгнанными с Небес падшими ангелами. Кроме того, их общим врагом выступали ангелы, посылаемые библейским Богом против обеих рас, населяющих Подземный мир. В ходе Великой войны трёх фракций все три стороны понесли огромные потери. В частности, в ходе войны были убиты «Четыре великие владыки демонов» и библейский Бог. Из-за этого несколько сотен лет назад враждующие стороны были вынуждены прекратить войну, так и не определив победителя. Однако отношения между сторонами по-прежнему оставались напряжёнными. В связи с огромными потерями среди населения, демоны стали перерождать существ иных рас как демонов. Каждый перерождённый становился слугой превратившего его демона. Дабы стимулировать новых демонов к саморазвитию, была введена Рейтинговая игра, где демоны и их кланы могут демонстрировать свою силу и повышаться в ранге." 
        }
    },
    {
        id: 51,
        name: "Девушка напрокат", 
        url: "/anime/for-rent",
        release: {
            day: 10,
            month: 7,
            year: 2020,
        },
        seasons: 2,
        series: 24,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            }
        ],
        author: "Рэйдзи Миядзима",
        texts: {
            plot: "В основе сюжета лежит образ реально существующих услуг в Японии, позволяющих нанять на какое-то время человека, который будет играть роль друга, супруга, ребенка или девушки/парня определенное время[2].После того как Кадзую бросает его первая девушка, он решает попробовать воспользоваться онлайн-сервисом по аренде девушек. Красивая и доброжелательная Тидзуру Мидзухара оказывается даже слишком идеальной на его вкус. Но он продолжает заказывать её, чтобы показывать окружающим и членам семьи, что у него всё хорошо и даже есть девушка. Множество совпадений, таких как то, что они живут в соседних квартирах или ходят в один университет, связывает героев, как и желание Кадзуи не расстраивать свою бабушку[2]. Довольно скоро Кадзуя обнаруживает, что́ прячется за идеальным образом Тидзуру." 
        }
    },
]

module.exports = animesFour