const animesFour = [
    {
        id: 49,
        name: "Один на вылет", 
        url: "/anime/departure",
        release: {
            day: 1,
            month: 10,
            year: 2008,
        },
        seasons: 1,
        series: 25,
        isComing: false,
        genres: [
            {
                name: "спорт",
                url: "/genres/sport"
            }, 
        ],
        author: "Синобу Кайтани",
        texts: {
            plot: "Хиромичи Коджима он ведущий бэттер в профессиональной команде бейсболистов. Его верный питчер Наканэ и тренер устроили тренировочный лагерь на Акинаве. С тех пор как Коджима 21 год назад присоединился к Лекоонсу, он завоевал звание — новичок года. Но за всю карьеру бейсболиста Коджима ни разу не выиграл ни одного чемпионата, из-за чего остальные его считают невезучим гением бэттера. Для победы ему не хватает какого-то недостающего звена, и организованный лагерь был чтобы найти его. И именно здесь Коджима встретит именно его — Тоа Токучи — гений питчер.Кадры" 
        }
    },
    {
        id: 50,
        name: "Демоны старшый школы", 
        url: "/anime/older",
        release: {
            day: 6,
            month: 9,
            year: 2012,
        },
        seasons: 4,
        series: 52,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            }
        ],
        author: "Итиэй Исибуми",
        texts: {
            plot: "Согласно сюжету ранобэ, демоны с древних времен сражались за контроль над Подземным миром с изгнанными с Небес падшими ангелами. Кроме того, их общим врагом выступали ангелы, посылаемые библейским Богом против обеих рас, населяющих Подземный мир. В ходе Великой войны трёх фракций все три стороны понесли огромные потери. В частности, в ходе войны были убиты «Четыре великие владыки демонов» и библейский Бог. Из-за этого несколько сотен лет назад враждующие стороны были вынуждены прекратить войну, так и не определив победителя. Однако отношения между сторонами по-прежнему оставались напряжёнными. В связи с огромными потерями среди населения, демоны стали перерождать существ иных рас как демонов. Каждый перерождённый становился слугой превратившего его демона. Дабы стимулировать новых демонов к саморазвитию, была введена Рейтинговая игра, где демоны и их кланы могут демонстрировать свою силу и повышаться в ранге." 
        }
    },
    {
        id: 51,
        name: "Девушка напрокат", 
        url: "/anime/for-rent",
        release: {
            day: 10,
            month: 7,
            year: 2020,
        },
        seasons: 2,
        series: 24,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            }
        ],
        author: "Рэйдзи Миядзима",
        texts: {
            plot: "В основе сюжета лежит образ реально существующих услуг в Японии, позволяющих нанять на какое-то время человека, который будет играть роль друга, супруга, ребенка или девушки/парня определенное время[2].После того как Кадзую бросает его первая девушка, он решает попробовать воспользоваться онлайн-сервисом по аренде девушек. Красивая и доброжелательная Тидзуру Мидзухара оказывается даже слишком идеальной на его вкус. Но он продолжает заказывать её, чтобы показывать окружающим и членам семьи, что у него всё хорошо и даже есть девушка. Множество совпадений, таких как то, что они живут в соседних квартирах или ходят в один университет, связывает героев, как и желание Кадзуи не расстраивать свою бабушку[2]. Довольно скоро Кадзуя обнаруживает, что́ прячется за идеальным образом Тидзуру." 
        }
    },
    {
        id: 52,
        name: "Класс превосходства", 
        url: "/anime/superiority",
        release: {
            day: 12,
            month: 06,
            year: 2017,
        },
        seasons: 2,
        series: 25,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "школа",
                url: "/genres/school"
            },
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            }
        ],
        author: "Сёго Кинугаса",
        texts: {
            plot: "В недалёком будущем японское правительство основало школу Кодо Икусэй, призванную обучать и воспитывать поколение людей, которые будут поддерживать страну в будущем. Студентам предоставляется высокая степень свободы, чтобы максимально сымитировать реальную жизнь.Повествование ведётся от лица Киётаки Аянокодзи — тихого и неприметного парня, который не отличается способностью заводить друзей. Он учащийся класса «D», куда школа определяет худших учеников. После встречи с Судзунэ Хорикитой и Кикё Кусидой, двумя его одноклассницами, его положение начинает меняться." 
        }
    },
    {
        id: 53,
        name: "Рейтинг короля ", 
        url: "/anime/king",
        release: {
            day: 15,
            month: 10,
            year: 2021,
        },
        seasons: 1,
        series: 23,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "приключение",
                url: "/genres/adventure" 
            }
        ],
        author: "Тока Сосукэ",
        texts: {
            plot: "В мире существует негласный рейтинг королей, который зависит от многих показателей, а именно числа верных рыцарей, экономического роста королевства и отваги самого правителя. Принц Бодж родился совсем хиленьким малышом, а к тому же у него отсутствовал слух. В будущем юноша должен занять трон своего отца, но нынешняя королева не видит у мальчишки необходимых качеств настоящего правителя. Все придворные и жители королевства начали насмехаться над юным принцем, ведь он даже не умеет внятно разговаривать. Очень часто Бодж ходит за пределы замка, чтобы немного погрустить. На одной из таких прогулок на юношу напал грабитель из клана теней по имени Кагэ. Злодей забрал у юнца одежду, но при этом попросил на следующий раз прийти в более дорогом одеянии. Принц никому не рассказал о случившемся, а поэтому на следующий день отправился на встречу в шикарной одежде. Оказалось, что Кагэ понимает речь принца, а потому подростку было приятно проводить время с ним. Настал тот день, когда тень пробралась в замок, и она узнала тайну будущего короля." 
        }
    },
    {
        id: 54,
        name: "ДжоДжо", 
        url: "/anime/jojo",
        release: {
            day: 13,
            month: 10,
            year: 2012,
        },
        seasons: 6,
        series: 170,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "ужасы",
                url: "/genres/horror"
            },
            {
                name: "боевик",
                url: "/genres/action"
            }
        ],
        author: "	Хирохико Араки",
        texts: {
            plot: "Из поколения в поколение потомки семейства Джостаров наследуют родимое пятно в форме звезды, инициалы ДжоДжо и семейное дело - раз за разом спасать мир. Каждый ДжоДжо - индивидуален и в то же время разделяет точку зрения предшественников о добре и справедливости. От Англии 19 века до современной Японии - это поистине невероятное приключение длиною не просто в жизнь героя, а в жизнь целого семейного древа.Множество практически независимых историй, связанных линией родства главных героев, посвящены головокружительным путешествиям, безумным сражениям и, конечно же, вечным вопросам дружбы и любви." 
        }
    },
    {
        id: 55,
        name: "Пламенная бригада пожарных ", 
        url: "/anime/fiery",
        release: {
            day: 5,
            month: 7,
            year: 2019,
        },
        seasons: 2,
        series: 48,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "приключение",
                url: "/genres/adventure" 
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "	Ацуси Окубо",
        texts: {
            plot: "Когда-то давно люди по всему миру начали самовозгораться и превращаться в огненных монстров. Эти монстры поджигали всё на своём пути сея хаос и смерть. Для борьбы с ними были созданы специальные пламенные бригады со сверхспособностями.Шинра Кусакабэ, прозванный «Дьявольские Ступни» из-за своей особенности воспламенять свои ноги, поступает на службу в пламенную бригаду пожарных. Он хочет стать героем и найти причину самовозгорания людей." 
        }
    },
    {
        id: 56,
        name: "Реинкарнация безработного", 
        url: "/anime/reincarnation",
        release: {
            day: 10,
            month: 1,
            year: 2021,
        },
        seasons: 1,
        series: 35,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            }
        ],
        author: "	Рифудзин-на Магонотэ",
        texts: {
            plot: "34 летний хикки погибает по канону жанра исэкай, спасая парнишку из-под колёс грузовика. Приходит в себя он в теле младенца и понимает, что переродился в фэнтезийном мире. Ему дан второй шанс, и он намерен прожить новую жизнь лучше. В новом мире с малых лет он проявляет небывалый талант к магии и смекалки, ведь его сознание прошлой жизни осталось при нём." 
        }
    },
    {
        id: 57,
        name: "Эта фарфоровая кукла влюбилась", 
        url: "/anime/doll",
        release: {
            day: 9,
            month: 1,
            year: 2022,
        },
        seasons: 1,
        series: 12,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance"
            },
        ],
        author: "Синъити Фукуда",
        texts: {
            plot: "Вакана Годзё — первоклассник старшей школы, мечтающий стать мастером кукол хина. Однажды во время первого семестра его популярная одноклассница Марин Китагава видит, как он шьёт костюмы для кукол в классе домоводства. Марин хочет заняться косплеем и уже сшила костюм любимого персонажа видеоигры, но сама шьёт плохо и в итоге просит Вакану, которому это удаётся лучше, перекроить костюм. Несмотря на то, что Вакана ещё никогда не шил полноразмерные костюмы, он был вдохновлён упорством Марин и согласился." 
        }
    },
    {
        id: 58,
        name: "К-он!", 
        url: "/anime/K-he!",
        release: {
            day: 7,
            month: 4,
            year: 2009,
        },
        seasons: 2,
        series: 41,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "школа",
                url: "/genres/school"
            }
        ],
        author: "Какифлай",
        texts: {
            plot: "Начинающая гитаристка Юи Хирасава определённо да. Спасая школьный музыкальный клуб от закрытия, она собирает музыкальный коллектив, о котором давно мечтала, репетируя с бойкой барабанщицей Рицу, стеснительной бас-гитаристкой Мио, пианисткой Цумуги и позже присоединившейся крошкой Адзусой. Хотя, как сказать, репетируя - скорее попивая чай и болтая о девичьем, попутно выступая на концертах и раскрывая свой творческий потенциал. Как и «Lucky Star», «K-On!» можно отнести к классике повседневности, в центре которой будни группы старшеклассниц с их маленькими победами и поражениями, радостями и горестями. Но самое главное: это аниме про музыку и любовь к ней. Или к чаю… решайте сами!" 
        }
    },
    {
        id: 59,
        name: "Вольный стиль!", 
        url: "/anime/style",
        release: {
            day: 7,
            month: 4,
            year: 2013,
        },
        seasons: 3,
        series: 37,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "спорт",
                url: "/genres/sport"
            }
        ],
        author: " Хироко Уцуми",
        texts: {
            plot: "Поступив в старшую школу Иватоби, Харука со своим другом Макото записались в плавательный клуб, подружившись ещё с двумя новыми пловцами и сделав старую знакомую своим менеджером. И пусть Хару просто любил плавать, мечта о спортивных победах таки закралась ему в голову, когда парень узнал, что ему предстоит посоревноваться в скорости с Рином - другом детства." 
        }
    },
    {
        id: 60,
        name: "Первый шаг", 
        url: "/anime/step",
        release: {
            day: 3,
            month: 10,
            year: 2000,
        },
        seasons: 3,
        series: 127,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "спорт",
                url: "/genres/sport"
            },
            {
                name: "драма",
                url: "/genres/drama"
            }
        ],
        author: "Хадзимэ но Иппо",
        texts: {
            plot: "Трудолюбивый парень Иппо Макуночи днём учиться в старшей школе, а после занятий помогает матери в магазине. Каждый день юноша носит увесистые коробки, в которых находятся различные товары. Макуночи имеет хорошую физическую форму, но при этом имеет трудности в общении со сверстниками. Школьник всегда был малообщительным и застенчивым подростком, а потому у него небольшое количество друзей. После школы Иппо всегда задирают хулиганы, которые частенько избивают бедолагу. В очередной раз уличные бандиты напали на Макуночи и начали беспощадно его бить, но вовремя драку заметил Такамура Сан, который является тренером по боксу. Мужчина ловко и молниеносно справился с обидчиками школьника, что очень поразило юношу. После драки Такамура Сан предложил стеснительному пареньку записаться в его спортивную секцию. Подросток согласился на предложение и теперь его ждут изнурительные тренировки, а также спарринги с умелыми бойцами. Иппо решил полностью отдаться боксу, чтобы иметь возможность не только защищать себя и родных, но и завоевать титул сильнейшего боксёра в мире." 
        }
    },
    {
        id: 61,
        name: "Инициал Ди", 
        url: "/anime/initial",
        release: {
            day: 18,
            month: 4,
            year: 1998,
        },
        seasons: 5,
        series: 81,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance" 
            },
            {
                name: "боевик",
                url: "/genres/action"
            }
        ],
        author: "Синъити Масаки",
        texts: {
            plot: "Такуми Фудзивара родился в семье профессионального гонщика, а потому с ранних лет привык проводить время вместе с отцом у машины. Мальчишка никак не может забыть тот момент, когда он впервые сел за руль автомобиля. Юноша сразу почувствовал страсть к вождению машины, а потому уже в двенадцать лет начал помогать отцу с развозкой тофу в отдалённые районы. Парню приходилось колесить по горной местности, где не каждый профессиональный водитель справится с поворотами и другими препятствиями на дороге. За долгие годы помощи папе с доставкой тофу подросток отточил свои навыки вождения до идеала. Однажды произошла передряга между двумя командами гонщиков, которые хотели доказать своё первенство и профессионализм. Одна из команд попросила отца Такуми поучаствовать в заезде, но по странному стечению обстоятельств на гоночную трассу вышел младший Фудзивара. Юноше удалось уделать лучшего гонщика из престижного района, и этот случай кардинально изменил жизнь паренька. Оказалось, что Такуми изобрёл собственную технику езды, которую никто не может освоить, и в этом есть его большое преимущество. Впереди парня ждёт множество заездов, а также крутых соперников." 
        }    
    },
    {
        id: 62,
        name: "Намбака ", 
        url: "/anime/nambaka",
        release: {
            day: 4,
            month: 10,
            year: 2016,
        },
        seasons: 1,
        series: 26,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "драма",
                url: "/genres/drama"
            }
        ],
        author: "Сё Футаматы",
        texts: {
            plot: "В мире существуют четыре преступника, которых не может удержать ни одна тюрьма. Правительство профинансировало грандиозный проект, а именно место для отбывания наказания под названием Нанба. Тюрьма оснащена новейшими системами безопасности и ни одному заключённому ещё не удалось сбежать из неё. Здание ограждено от внешнего мира огромной стеной, а внутри тюрьмы находится множество ловушек, которые тяжело обнаружить, а также обезвредить. Четвёрку легендарных преступников поместили в Нанбу и теперь ребятам придётся изрядно потрудиться, чтобы совершить побег. Каждому из заключённых даётся специальный номер, ведь по имени их никто не называет. Юго получил номер пятнадцать и этот преступник не переносит на дух окулистов, и он одержим побегами. Одиннадцатый номер достался Уно, который обожает играть в покер и он всю жизнь занимался аферами. Року назначили номер шестьдесят девять, и этот молодой человек обожает не только пончики, но и хорошенько подраться с кем-нибудь. Двадцать пятый номер получил Ника, который является заядлым анимешником и он считает, что вскоре весь мир будет охвачен аниме. Мастера своего дела вновь объединят свои сильные стороны, чтобы совершить самый грандиозный побег в своей жизни." 
        }
    },
    {
        id: 63,
        name: " Персона 5", 
        url: "/anime/person",
        release: {
            day: 7,
            month: 4,
            year: 2018,
        },
        seasons: 1,
        series: 28,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"  
            }
        ],
        author: "Кацура Хасино",
        texts: {
            plot: "На улицах Токио всё чаще начали происходить жестокие преступления, которые пугают каждого жителя города. Весь ужас заключается в том, что жуткие убийства совершают бывшие заключённые, которые недавно вышли из мест лишения свободы. Полиция никак не может арестовать бывшего преступника, который ещё не совершил преступления. Недавно в Токио прибыл Амамия Рен, и он имеет уникальную способность. Подросток может внедряться в сознание другого человека, а также сражаться с его внутренними демонами. Духовная энергия Амамия настолько велика, что в сознании других людей он может пользоваться управляемым существом. Недавно Рен вместе с друзьями создал необычную команду, которая занимается поиском бывших преступников. Ребята проникают в сознания злодеев, где происходит кровопролитное сражение с мистическим существом, которое заставляет человека совершать преступления. Вскоре о городских мстителях узнала секретная организация, и она вовсе не одобряет методы способных подростков." 
        }
    },
    {
        id: 64,
        name: "Девчонка не промах", 
        url: "/anime/girl",
        release: {
            day: 13,
            month: 7,
            year: 2018,
        },
        seasons: 2,
        series: 21,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "романтика",
                url: "/genres/romance"
            }
        ],
        author: "Рэнсукэ Осикири",
        texts: {
            plot: "На улице 1991 год и в это время малоразвиты компьютерные технологии, а потому повстречать компьютер в доме обычных граждан является большой редкостью. Всё же школьники нашли способ поиграть в любимые игры, и они начали посещать специальные клубы. В этом месте можно увидеть не только молодых ребят и девушек, но и взрослое поколение, которое находит в играх некий способ снять стресс. Харуо Ягучи обожает играть в 2D игры, и он преуспел в этом занятии лучше своих сверстников. В популярном клубе парня считают настоящим гуру, которого невозможно обыграть. Ягучи давно ищет себе достойного соперника, но ещё никому не удавалось обыграть непревзойдённого геймера. В очередной раз Харуо отправился на поиски развлечений, и ему на пути повстречалась необычная девчонка. Акиру Оно живёт в богатой семье и у неё имеется много талантов, а также уникальных навыков. Девушка предложила Ягучи сыграть в популярную игру, и мастер своего дела согласился без колебаний. В этот раз Харуо проиграл и это его очень задело. После ожесточённой схватки ребята решили подружиться, а также помочь друг другу повысить мастерство в видеоиграх." 
        }
    }
]

module.exports = animesFour