const animes = {
    count: 100,
    animes: [
        {
            name: 'Наруто',
            url: '/anime/naruto'
        },
        {
            name: "Магическая битва",
            url: "/anime/magicbattle"
        },
        {
            name: "Атака на титанов",
            url: "/anima/attackontitans"
        },
        {
            name: "Твоё имя",
            url: "/anime/yourname"
        },
        {
            name: "Блич",
            url: "/anime/bleach"
        },
        {
            name: "Токийские мстители",
            url: "/anime/tokyorevengers"
        },
        {
            name: "Человек-бензопила",
            url: "/anime/chainsawman"
        },
        {
            name: "Ван-Пис",
            url: "/anime/onepiece"
        },
        {
            name: "Волейбол",
            url: "/anime/volleyball"
        },
        {
            name: "Этот глупый свин не понимает мечту девочки-зайки",
            url: "/anime/seishun-buta"
        },
        {
            name: "Моя девушка не только милая все серии",
            url: "/anime/shiki-san"
        },
        {
            name: "Жемчуг дракона",
            url: "/anime/dragonball",
        },
        {
            name: "Тетрадь смерти",
            url: "/anime/death-note",
        },
        {
            name: "Ванпанчмен",
            url: "/anime/OnePunchMan",
        },
        {
            name: "Я побрился. И приютил старшеклассницу",
            url: "/anime/school-student",
        },
        {
            name: "Боец Баки",
            url: "/anime/bakifighter",
        },
        {
            name: "Токийский гуль",
            url: "/anime/tokyo-ghoul",
        },
        {
            name: "Клинок рассекающий демонов",
            url: "/anime/blade-demons",
        },
        {
            name: "Хантер х Хантер", 
            url: "/anime/hanter",
        },
        {
            name: "Бездомный Бог", 
            url: "/anime/homeless",
        },
        {
            name: "Семь смертных грехов", 
            url: "/anime/deadly-sins",
        },
        {
            name: "Класс убийц", 
            url: "/anime/assassin-class",
        },
        {
            name: "Фейри Тейл", 
            url: "/anime/feiry-tale",
        },
        {
            name: "Парад смерти", 
            url: "/anime/death-parade",
        },
        {
            name: "Милый во Франксе", 
            url: "/anime/francse",
        },
        {
            name: "Безумный азарт", 
            url: "/anime/insane",
        },
        {
            name: "Моя геройская акедемия", 
            url: "/anime/my-academy",
        },
        {
            name: "Дневник будущего", 
            url: "/anime/the-future",
        },
        {
            name: "Ао Аcи", 
            url: "/anime/ashi",
        },
        {
            name: "Дьявольские возлюбленные", 
            url: "/anime/lovers",
        },
        {
            name: "Мастер меча онлайн", 
            url: "/anime/master-online",
        },
        {
            name: "Линия Дьявола", 
            url: "/anime/line",
        },
        {
            name: "В лес, где мерцают светлячки", 
            url: "/anime/fireflies",
        },
        {
            name: "Я хочу съесть твою поджелудочную", 
            url: "/anime/pancreas",
        },
        {
            name: "Скейт: бесконечность", 
            url: "/anime/lnfinity",
        },
        {
            name: "Баскетбол Куроко", 
            url: "/anime/kuroko", 
        },
        {
            name: "Боруто", 
            url: "/anime/boruto",
        },
        {
            name: "Доктор Стоун", 
            url: "/anime/doctor",
        },
        {
            name: "Школа мертвецов", 
            url: "/anime/dead", 
        },
        {
            name: "Очень приятно Бог", 
            url: "/anime/cool-god",
        },
        {
            name: "Форма голоса", 
            url: "/anime/form",
        },
        {
            name: "Темный дворецкий", 
            url: "/anime/butler",
        },
        {
            name: "Хоромия", 
            url: "/anime/horimiya",
        },
        {
            name: "Магистр дьявольского культа", 
            url: "/anime/master",
        },
        {
            name: "Благословение небожителей ", 
            url: "/anime/blogging",
        },
        {
            name: "Один на вылет", 
            url: "/anime/departure",
        },
        {
            name: "Демоны старшый школы", 
            url: "/anime/older",
        }
    ],
}

const allAnime = [
    {
        id: 1,
        name: "Наруто", 
        url: '/anime/naruto',
        release: {
            day: 3,
            month: 10,
            year: 2002,
        },
        seasons: 2,
        series: 220,
        isComing: false,
        movies: 11,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Масаси Кисимото",
        texts: {
            plot: "За 12 лет до начала событий, излагаемых в манге, демон-лис напал на Деревню, скрытую в листве (яп. 木ノ葉隠れの里 Конохагакурэ но сато, или просто Коноха[12]). Для спасения Конохи глава селения, Четвёртый Хокагэ, жертвует своей жизнью и запечатывает демона-лиса внутри своего новорождённого сына Наруто.Хокагэ желал, чтобы люди считали Наруто героем, поскольку Наруто сдерживает демона-лиса. Однако жители деревни восприняли Наруто как демона во плоти и возненавидели его. После инцидента Хокагэ запрещает говорить об атаке лиса, и Наруто узнаёт о своей необычности лишь случайно, годы спустя.Манга делится на две части.Наруто с трудом завершает обучение и получает звание гэнина — начинающего ниндзя. Он и двое его одноклассников, Саскэ Утиха и Сакура Харуно, образуют команду под началом опытного сэнсэя Какаси Хатакэ. По мере развития сюжета Наруто находит новых друзей среди жителей деревни и овладевает новыми способностями, считая их необходимыми для того, чтобы в будущем исполнить свою мечту — стать Хокагэ. Вскоре Коноха подвергается атаке: беглый ниндзя и разыскиваемый преступник Оротимару вместе со своими приспешниками нападает на селение, убивая его главу — Третьего Хокагэ. Будучи в состоянии меняться телами с другими людьми, Оротимару желает заполучить тело Саскэ Утихи, считая его наследственные способности подходящими для себя, так как Саскэ является представителем клана Утиха, наиболее одарённого среди ниндзя. Саскэ добровольно уходит к Оротимару, полагая, что тот даст ему возможность стать сильнее и отомстить своему старшему брату Итати. До начала событий манги Итати уничтожил весь клан Утиха за исключением Саскэ, для которого месть превратилась в смысл жизни. Наруто, желая вернуть ушедшего Саскэ, покидает Коноху и посвящает себя тренировкам. Он занимается с легендарным ниндзя Дзирайей, бывшим товарищем Оротимару, чтобы подготовиться к следующей встрече и возможной битве с Саскэ.После тренировок с Дзирайей Наруто возвращается в Деревню Скрытой Листвы и воссоединяется с повзрослевшими друзьями. Команда № 7, ранее состоявшая из Наруто, Саскэ и Сакуры, переформировывается. Теперь она называется «Команда Какаси», а место Саскэ в ней занимает другой молодой ниндзя — Сай. Ведущую роль противников Наруто и его друзей занимает организация «Акацуки», члены которой стремятся захватить всех хвостатых демонов, включая девятихвостого, заточённого внутри Наруто. Тем временем Саскэ Утиха, считая дальнейшее обучение у Оротимару бессмысленным, предаёт его и убивает. Отыскав своего старшего брата, чтобы отомстить за уничтожение клана, вступает с ним в бой, во время которого Итати неожиданно падает замертво. После этого лидер Акацуки, Тоби, сообщает Саскэ правду о том, что убийство клана было поручено Итати непосредственно руководством Деревни Скрытой Листвы в связи с планированием ими мятежа. Обозлённый этим открытием, Саскэ присоединяется к Акацуки с целью уничтожить Коноху. Тем временем по приказу Тоби члены Акацуки атакуют деревню Скрытой Листвы. Ценой больших усилий жителям Конохи удаётся отбить нападение, однако сама деревня оказывается практически полностью разрушена. На совете Кагэ — лидеров крупнейших селений ниндзя — Тоби заявляет, что собирает хвостатых демонов ради воссоздания десятихвостого бидзю и создания могущественной иллюзии, способной контролировать человечество. Когда руководители других селений отказываются помогать Тоби, он объявляет о начале Четвёртой мировой войны ниндзя. В ответ на это пять крупнейших стран создают альянс, во главе которого становится Райкагэ, и объединённую армию синоби, главнокомандующим которой становится Кадзэкагэ Гаара[14]. Начинаются бои между сторонами: на стороне Акацуки сражаются многочисленные клоны Дзэцу и призванные бывшим союзником Оротимару Кабуто Якуси умершие ниндзя, а на стороне альянса — синоби пяти стран. На второй день войны Дзэцу возрождает Кагую Оцуцуки, прародительницу искусства синоби, когда-то сорвавшую с древа чакры плод и давшую его людям. Ныне же она хочет вернуть чакру себе, для чего ранее «Акацуки» и собирали хвостатых зверей. Команде Какаси удаётся победить Кагую и запечатать её, а Наруто сражается с Саскэ, и тот признаёт поражение. В последней главе манги показана жизнь Конохи спустя десятилетие." 
        }
    },
    {
        id: 2,
        name: "Магическая битва",
        url: "/anime/magicbattle",
        release: {
            day: 2,
            month: 10,
            year: 2020,
        },
        seasons: 1, 
        series: 24,
        isComing: {
            nextRelease: {
                day: 14,
                month: 7,
                year: 2023,
            }
        },
        movies: 1,
        genres: [
            {
                name: "демоны",
                url: "/ganres/demons",
            },
            {
                name: 'фэнитези',
                url: "/ganres/fantasy",
            },
            {
                name: "школа",
                url: "/ganres/school",
            }
        ],
        author: "Акутами Гэгэ",
        texts: {
            plot:"Юдзи Итадори — сильный юноша, который ведёт заурядную жизнь старшеклассника. Однажды, чтобы спасти друзей от нападения проклятий, он съедает палец Двуликого призрака, который становится частью его души. С этого момента он делит с ним своё тело. Под присмотром Сатору Годзё, одного из сильнейших магов, Итадори поступает в магический техникум, где учат сражаться с проклятиями." 
        }
    },
    {
        id:3,
        name: "Атака на титанов", 
        url: "/anima/attackontitans",
        release: {
         day: 7,
         month: 4,
         year: 2013,
        },
        seasons: 4, 
        series: 87,
        isComing: false,
        movies: 2,
        genres: [
             {
             name:"драма",
             url: "/genres/drama",
             },    
             {
             name: "фэнтези",
             url: "/genres/fantasy"
             }
        ],
        author: "Хадзимэ Исаяма",
        texts: {
         plot:"В прошлом столетии человечество страдало из-за нашествия гигантов. Они были очень похожи внешностью на простых людей, но также имели несколько отличий. Разница состояла в слишком больших размерах созданий и в их абсолютной глупости. Действовали великаны, как зомби из банальных фильмов ужасов. Они не могли похвастаться разумом и полностью соответствовали своему первобытному инстинкту, связанному с выживанием. Поэтому эти существа неустанно пожирали беззащитное население, совершенно не чувствуя к нему сожаления. Под натиском воцарившегося безумия, жители планеты начали постепенно вымирать. Те, кому повезло остаться в живых, приняли решение объединиться и приступить к самозащите. Народ вскоре построил высокие стены, которые отличались поразительной прочностью. Практически целый век люди спокойно существовали и даже начали забывать о беспощадных врагах. Страх наконец-то сменился умиротворением. Эрен давно желает вступить в группу разведчиков, ведь он полагает, что противники могут вернуться и проломить заграждение. И вскоре его опасения подтверждаются. Сможет ли юный герой справиться с могущественными соперниками?"
        }
    },
    {
        id: 4,
        name: "Твоё имя",
        url: "/anime/yourname",
        release: {
            day: 26,
            month: 8,
            year: 2016,
        },
        isComing: false, 
        movies: 1,
        genres: [
            {
                name:"драма",
                url: "/genres/drama", 
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "школа",
                url: "/genres/school"  
            }
        ],
        author: "Макото Синкай",
        texts: {
            plot: "Действие в аниме Твое имя будет происходить в двух городах. Главными героями является парочка обычных людей, которые даже не подозревают, что вскоре судьба свяжет их жизни очень крепко. Они никогда не были знакомы, она – любимая дочь, которая свое свободное время посвящает работе в храме. Он – надежный друг, успешен и трудолюбив на работе, имеет неплохие задатки талантливого художника. Ее жизнь спокойна и размерена в небольшом провинциальном городке, в то время как он живет в огромном мегаполисе, полном суматохи и постоянном бегстве.Мицуха Миямизу и Таки Тачибана никогда не встречали друг друга, и тем не менее, их связывает одно странное событие. Однажды во сне они меняются телами и совершенно непонятно как контролировать этот процесс. Такое начинает повторятся все чаще и чаще, что создаст немало проблем в жизни наших героев, ведь просыпаться каждый день в чужой постели в чужом доме не очень приятно. Но в чем же причина таких необычных метаморфоз? Именно в этом придется разобраться главным героям."
        }
    }, 
    {
        id:5,
        name: "Блич",
        url: "/anime/bleach",
        release: {
            day: 5,
            month: 10,
            year: 2004,
        },
        seasons: 2, 
        series: 379,
        isComing: {
            nextRelease: {
                day:31,
                month: 7,
                year: 2023,
            }
        },
        movies: 4,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "приключение",
                url: "/genres/romance"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Кубо Тайто",
        texts: {
            plot: "События происходят на территории Японии, где проживает Ичиго Куросаки. Парень с ранних лет отличается от сверстников, ведь он умеет общаться с призраками. Однажды к нему в комнату залетает барышня, которую зовут Рукия Кучики. Незваная гостья является неким проводником человеческих душ. Девушка сильно удивляется тому, что юноша имеет способность видеть её и даже прикасаться. Пока ошеломлённая героиня томится в размышлениях, в помещение неожиданно врывается злой дух, называемый «пустым».Рукия мгновенно бросается спасать мальчишку, в результате чего развязывается нешуточное противостояние и она получает сильнейшее ранение. Девочка поняла, что не может продолжать бороться и принимает решение передать собственные силы новоиспеченному приятелю. Ичиго ловко поглощает переданную энергию и расправляется со злодеем. Но оказывается, что поделившись даром, девушка стала настоящей преступницей и теперь её непременно накажут. Юному храбрецу ничего не остается, как встать на защиту подруги."
        }
    },
    {
        id:6,
        name: "Токийские мстители",
        url: "/anime/tokyorevengers",
        release: {
            day: 11,
            month: 4,
            year: 2021,
        },
        seasons: 1, 
        series: 24,
        isComing: {
            nextRelease: {
                day: 8,
                month: 1,
                year: 2023
            },
        },
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "школа",
                url: "/genres/school"
            }
        ],
        author: "Кэном Вакуи",
        texts: {
            plot:"Двадцатишестилетний Такэмити Ханагаки — неудачник. Домовладелица ругается, управляющая на работе вечно придирается, даже маленькие дети задирают. В новостях он узнаёт о гибели девушки, с которой когда-то встречался. Попадает под поезд. Но это ещё не конец. Таинственным образом Такэмити оказывается в прошлом, ровно в тот день, когда вся его жизнь пошла наперекосяк. Может быть, у него ещё есть шанс всё исправить."
        }  
    },
    {
        id:7,
        name: "Человек-бензопила",
        url: "/anime/chainsawman",
        release: {
            day: 12,
            month:10,
            year: 2022,
        },
        seasons: 1, 
        series: 12,
        isComing: false,     
        genres: [
            {
                name: 'демоны',
                url: "/genres/demons"
            },
            {
                name: "приключение",
                url: "/genres/romance"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author:"Тацуки Фудзимото",
        texts: {
            plot:"Дэндзи приходится полностью изменить свою жизнь, чтобы отработать непомерные долги отца. Он становится подручным якудзы в нелегком деле уничтожения демонов. На второй план отошли не только сон и отдых, а и общение с любимой девушкой. Только дьявольский питомец-помощник Почита вносит немного разнообразия в череду кровавых будней.Теперь у Дэндзи лишь одна цель – деньги, только в них он видит шанс на освобождение. Желая быстрей получить прибыль, парень забывает об осторожности и в одной из схваток погибает. Верный Почито спасает хозяина, слившись с ним и дав способность частичного превращения в бензопилу. Переродившийся Дэндзи продолжает крушить врагов налево и направо, чем привлекает внимание Бюро общественной безопасности. Теперь вместо якудзы ему приходится выполнять поручения правительства. В этом он видит возможность возвращения к нормальной жизни, поэтому, не страшась, выступает против самых могущественных противников. Но стоит ли так рьяно сокращать количество демонов? Не накличет ли Дэндзи еще больших бед?"
        }
    },
    {
        id:8,
        name: "Ван-Пис",
        url: "/anime/onepiece",
        release: {
            day: 20,
            month: 10,
            year: 1999,
        },
        seasons: 1,
        series: 1046,
        isComing:{
            nextRelease: {
                day: 29,
                month: 1,
                year: 2023
            },
            genres:[
                {
                    name: "драма",
                    url: "/genres/drama" 
                },
                {
                    name: "комедия",
                    url: "/genres/comedy"
                },
                {
                    name: "приключение",
                    url: "/genres/romance"
                },
                {
                    name: "фэнтези",
                    url: "/genres/fantasy"
                }
            ],
            author: "Эйитиро Оды",
            texts: {
                plot: "Главный герой этой истории - парень в соломенной шляпе по имени Монки Д. Луффи. Все о чем мечтает наш герой - это приключения и путешествия. Будучи маленьким ребенком, он съедает дьявольский фрукт и становится резиновым человеком. Теперь у него есть необычная способность - он может растягивать свое тело и конечности до любых размеров. Сейчас перед Луффи стоит цель - стать главным среди пиратов. Но для этого, судя по легендам, необходимо добраться до древнего сокровища Ван Пис. Когда-то сам Гол Д. Роджер спрятал его где-то на Гранд Лайн, течении, которое объединяет множество островов по всему миру. Наш весельчак решает отправиться на их поиски.Однако, наш персонаж далеко не единственный, кто охотится за золотом Роджера. Казалось бы, у нашего смышленого парня есть всё, для того чтобы стать королем - необычайная сила и острый ум. Не хватает только одного - верной и преданной команды, которые последуют за своим капитаном навстречу любой опасности. Вот только Луффи стоит поторопиться, ведь за Ван Пис идет целая ватага злобных пиратов, которая не остановится ни перед чем, чтобы добраться до заветного сокровища. Монки придется предпринять немало усилий, чтобы опередить всех своих соперников."
            }
        }
    },
    {
        id: 9,
        name: "Волейбол",
        url: "/anime/volleyball",
        release: {
            day: 8,
            month: 10,
            year: 2016
        },
        seasons: 4,
        series: 85,
        isComing: false,
        genres: [
            {
                name: "драма",
                url: "/genres/drama" 
            },
            {
                name: "комедия",
                url: "/genres/comedy"
            },
            {
                name: "спорт",
                url: "/genres/sport" 
            },
            {
                name: "школа",
                url: "/genres/school"
            }
        ],
        author: "Харуити Фурудатэ",
        texts: {
            plot: "Сёё Хината – обычный двенадцатилетний школьник. Его новым увлечением становится игра в волейбол, которая полностью захватывает нашего героя. И вот, спустя три года, ему удается вместе со своей школьной командой дойти до крупного турнира. Но на первом же круге, в соперники новичкам попадается более опытная команда с очень сильным плеймекером Тобио Кагэяма. Талантливый игрок практически в одиночку расправляется с командой новичков. Теперь Хината предстоит перейти в старшую школу, а значит, и в новую волейбольную команду. Так он попадает в школу Карасуно, и само собой, первым делом отправляется записываться в команду. Среди других претендентов оказывается и Кагэяма.Таким образом, два старых соперника оказываются в одной команде, защищая черно-желтые цвета Карасуно. Хината – трудолюбивый парень, который предпочитает командную игру. Кагэяма же напротив, всегда берет игру на себя. Такой разноплановый дуэт на удивление оказывается очень продуктивным, чему очень рад тренер команды. Теперь у наших героев впереди множество соревнований и побед."
        }       
    },
    {
        id: 10,
        name: "Этот глупый свин не понимает мечту девочки-зайки",
        url: "/anime/seishun-buta",
        release: {
            day:3,
            month: 10,
            year: 2018
        },
        seasons: 1,
        series: 13,
        isComing: false,
        movies: 1,
        genres:[
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "драма",
                url: "/genres/drama" 
            }
        ],
        author: "Хадзимэ Камосидой",
        texts: {
            plot: "Импульсивный парень Азусагава Сакута избирательно относится к выбору друзей, которых у него имеется всего лишь двое. Юноша очень любит свою сестрёнку, из-за которой он недавно попал в школьные новости, ведь школьнику пришлось избить хулиганов. Мобильным телефоном парнишка не пользуется, и он даже не знает, что о нём пишут разные гадости. Однажды Азусагава посетил школьную библиотеку, в которой он повстречал сногсшибательную девчонку. Оказалось, что это была Сакураджима Май, и она является настоящей звездой. Вот только девушка была странно одета, что немного обескуражило Сакута. Зайти в библиотеку в костюме зайки мало кто осмелится, а потому этот случай запомнился юноше. На следующий день Азусагава встретил Май в поезде. Девушка поделилась своей проблемой со смышлёным и симпатичным парнем. Дело в том, что Сакураджиме надоела популярность, и она пожелала стать невидимой. Странным образом желание Май исполнилось и теперь известную красавицу не только не замечают люди, но и начинают потихоньку забывать о существовании популярной звезды. Сакута решил помочь бедолаге и теперь ему нужно разобраться во всём происходящем."
        },  
    },
    {
        id: 11,
        name: "Моя девушка не только милая все серии",
        url: "/anime/shiki-san",
        release: {
            day: 10,
            month: 4,
            year: 2022
        },
        seasons: 1,
        series: 12,
        isComing: false,
        genres:[
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "романтика",
                url: "/genres/romance"
            }
        ],

        author: "Кэйго Маки",
        texts: {
            plot: "Идзуми и Сикимори — типичная влюблённая парочка из старшей школы. Но когда Идзуми попадает в неприятности, Сикимори преображается в очень крутую героиню, заставляющая всех вокруг восхищаться ею."
        },
    },
    {
        id: 12,
        name: "Жемчуг дракона",
        url: "/anime/dragonball",
        release: {
            day: 20,
            month: 6,
            year: 1986
        },
        seasons: 5,
        series: 798,
        isComing: false,
        movies: 16,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Акира Торияма",
        texts: {
            plot: "Главный герой произведения, мальчик с обезьяньим хвостом по имени Сон Гоку (японское чтение имени «Сунь Укун»), учится боевым искусствам и изучает мир в поисках семи мистических предметов, которые известны как «жемчуг дракона». По легенде, они исполняют любое желание, если собрать их вместе. Сначала он встретил городскую девочку-подростка, Бульму, которая искала жемчуг дракона, чтобы найти себе парня. К ним в путь присоединились человек-свинья Улонг, умеющий превращаться в любые вещи, и пустынный бандит Ямча, страдающий гинофобией. Также в пути Гоку повстречал своего будущего учителя Мутэна Роши, мастера боевых искусств, который любит читать порно-журналы, Демона Князь-Быка (Гьюмао) и его дочь Чи-Чи, на которой Гоку по глупости хотел жениться, думая что свадьба — это прием пищи. В первом томе манги злодеем был глупый император Пилаф, который хотел править миром."
        }
    },
    {
        id: 13,
        name: "Тетрадь смерти",
        url: "/anime/death-note",
        release: {
            day: 4,
            month: 10,
            year: 2006
        },
        seasons: 1,
        series: 37,
        isComing: false,
        genres: [
        {
            name: "фэнтези",
            url: "/genres/fantasy"
        }
        ],
        author: "Нисио Исин",
        texts: {
            plot: "Главный герой аниме, Лайт Ягами, является лучшим школьником Японии и сыном полицейского. Однажды богу смерти по имени Рюк стало скучно, поэтому он решил бросить одну из своих тетрадей смерти в мир людей. По дороге из школы Лайт находит лежащую на земле чёрную тетрадь и решает проверить её работоспособность. Придя домой, он в соответствии с правилами вписал в тетрадь имя преступника, которого в то время показывали по телевидению. На удивление Лайта, преступник действительно умер от сердечного приступа через сорок секунд. Удостоверившись в работоспособности тетради смерти, он решает построить новый мир, где будут жить только добрые и ответственные люди, лишая жизни всех преступников, о которых упоминают средства массовой информации[4]. Через некоторое время Рюк является Лайту. Он рассказывает, что Лайт получил тетрадь по чистой случайности, так как Рюк отправил её в мир людей из скуки, и теперь он надеется, что Лайт развлечёт его, но не обещает помогать, по большей части оставаясь лишь сторонним наблюдателем. Общественность дала Лайту прозвище «Кира» (яп. キラ с англ. — «Killer»)[4]. Заметив сверхъестественную тенденцию смерти преступников от сердечных приступов, происходящим начинает интересоваться японская полиция, а также Интерпол, помощь которому предлагает гениальный детектив под псевдонимом L[5]. С этого момента начинается битва двух умов — лучшего ученика Японии с одной стороны и лучшего детектива — с другой. Несмотря на успехи L в качестве детектива, его личность всегда оставалась тайной для общественности и других детективов. Однако при расследовании «дела Киры» он впервые показал себя, контактируя с полицейскими, входящими в группу по поимке Лайта[6]. Лайт не может совершать ошибки, ведь если его поймают, он не сможет вершить своё правосудие и получит смертный приговор. Его оппонент тоже не может сделать ни одной ошибки, потому что в противном случае Кира убьёт его. В это противостояние вмешиваются сверхъестественные силы в лице богов смерти, а также другие последователи Киры и сторонники L."
        }
    },
    {
        id: 14,
        name: "Ванпанчмен",
        url: "/anime/OnePunchMan",
        release: {
            day: 5,
            month: 10,
            year: 2015
        },
        seasons: 2, 
        series: 24,
        isComing: false,
        genres: [
         {
            name: "боевик",
            url: "/genres/action"
         },
         {
            name: "комедия",
            url: "/genres/comedy",
         },
         {
            name: "фэнтези",
            url: "/genres/fantasy"
         }
        ],
        author: "ONE",
        texts: {
            plot: "На неназванной планете бушуют монстры, для борьбы с которыми была создана Ассоциация Героев (англ. Hero Association). В ней каждый из её членов ранжируется от класса «C» до класса «S». Класс героя зависит от его репутации и способностей.Главный герой — Сайтама[⇨], совершающий героические поступки ради собственного развлечения. Он с детства мечтал стать супергероем. Повзрослев и впервые сразившись с монстром, он начал свои тренировки, которые, по его словам, довели его до того, что ныне он может одолеть любого соперника одним ударом. Несмотря на свои подвиги, Сайтама не афишировал их и долгое время оставался неизвестным обществу. Обретя в качестве ученика юного киборга Геноса[⇨], Сайтама узнаёт от него о Ассоциации Героев и вступает в неё, пройдя с рекордами все физические испытания, но завалив письменную часть, из-за чего попадает в C-класс, а Генос в S-класс. Так получается, что большинство героев, что знакомятся с Сайтамой, смотрят на него «свысока», не веря в то, что он на самом деле он сильнее любого Героя Ассоциации, но те, кто узнают его ближе, начинают его уважать и проситься в его ученики. Постепенно имя Сайтамы обретает некую известность, однако общество по-прежнему отказывается признавать его заслуги и даже подвергает героя критике за уничтоженные в ходе битв городские строения. Несмотря на это, Сайтама продолжил своё участие в Ассоциации героев и был позже зачислен в B-класс. После атаки инопланетян, корабль которых был уничтожен Сайтамой, Ассоциация Героев получила дополнительное финансирование и расширила собственное влияние. Монстры, недовольные усилением Ассоциации Героев, создали собственную Ассоциацию Монстров (англ. Monster Association), которая начала организованную борьбу с героями."
        }
    },
    {
        id: 15,
        name: "Я побрился. И приютил старшеклассницу",
        url: "/anime/school-student",
        release: {
            day: 5,
            month: 4, 
            year: 2021
        },
        seasons: 1,
        series: 13,
        isComing: false,
        genres: [
                {
                    name: "романтика",
                    url: "/genres/romance"  
                },
                {
                    name: "драма",
                    url: "/genres/drama"
                },
            ],
            author: "Симэсаба",
            texts: {
                plot: "Ёсиду отвергает девушка, в которую он был влюблён пять лет. Возвращаясь пьяным из бара он находит у обочины дороги школьницу... Не успев опомниться, он соглашается её приютить. Так начинается история двадцатишестилетнего служащего и сбежавшей школьницы."
            },
    },
    {
        id: 16,
        name: "Боец Баки",
        url: "/anime/bakifighter",
        release: {
            day: 8,
            month: 1,
            year: 2001
        },
        seasons: 5,
        series: 99,
        isComing: false,
        genres: [
                {
                    name: "спорт",
                    url: "/genres/sport"
                },
                {
                    name: "боевик",
                    url: "/genres/action"
                },
            ],
            author: "Кэйсукэ Итагаки",
            texts: {
                plot: "В мире боевых искусств существует легендарный титул Король ринга и он принадлежит безжалостному бойцу по имени Юдзиро Ханма. Мужчина всю жизнь посвятил тренировкам, а потому он стал обладателем нечеловеческой силы. Юдзиро является сильнейшим бойцом на планете, и представители разных школ боевых искусств шарахаются безжалостного убийцу. У Короля ринга есть сын, которого зовут Баки и ему недавно исполнилось тринадцать лет. Когда Баки был малышом, он стал свидетелем унижения собственной матери, которая пострадала от руки безжалостного папаши. Юноша поклялся, что отомстит кровожадному отцу и для этого ему пришлось тренироваться с пелёнок. В свои тринадцать лет подросток способен в одиночку перебить больше тридцати человек и при этом остаться в живых. Вот только такие результаты школьника не устраивают, ведь он хочет попасть на всемирный турнир, где будут участвовать лучшие мастера со всей планеты, а также заклятый враг Баки. Впереди парня ждут сложные тренировки, а также и опасные схватки с умелыми противниками. Мальчишка готов не только идти до конца, но и положить на кон собственную жизнь, ведь он обязан выполнить обещание, данное матери.Демонстрацию уникальных боевых стилей, кровавые схватки и смертельные поединки придётся увидеть зрители аниме Grappler Baki. Вскоре юноше улыбнётся фортуна, и он попадёт на великий турнир, на котором ему повстречаются превосходные и достойные бойцы со всего мира."
            },
    },
    {
        id: 17,
        name: "Токийский гуль",
        url: "/anime/tokyo-ghoul",
        release: {
            day: 3,
            month: 6,
            year: 2014
            },
        seasons: 4,
        series: 50,
        isComing: false,
        genres:[
                {
                    name: "ужасы",
                    url: "/genres/horror"
                },
                {
                    name: "драма",
                    url: "/genres/drama"
                },
            ],
            author: "Син Товада",
            texts: {
                plot: "Про нового гуля узнает организация, которая называет себя CCG (Управление по борьбе с Гулями). В этой организации служит один из сильнейших инспекторов – Арима Кишо. Он уже уничтожил много гулей, тем самым заслужил все общее внимание и уважение. Его история начинается с убийства его друга. Один из гулей решил ради забавы поиграть с людьми, Арима и его друг попались ему, гуль убил его друга моментально, а самого Ариму оставил в живых, чтобы немного позабавиться, и это была его самая большая ошибка."
            },
    },
    {
        id: 18,
        name: "Клинок рассекающий демонов",
        url: "/anime/blade-demons",
        release: {
            day: 6,
            month: 4,
            year: 2019
            },
        seasons: 3,
        series: 44,
        isComing: false,
        genres: [
            {
                    name: "боевик",
                    url: "/genres/action"
            },
        ],
            author: "Коёхару Готогэ",
            texts: {
                plot: "Тот пропал при странных обстоятельствах, а юноша взвалил на себя ответственность за семью. Когда Танджиро отправился продавать уголь, он не думал, что при возвращении домой застанет кровавую картину. Его родственники были убиты. Семья растерзана, и везде по дому виднеются следы крови. Единственный человек оставшийся в живых – сестренка главного героя. Она рассказала о демонах пришедших из леса в их дом. Оказалось, что девушка была ими обращена и скоро может стать убийцей. Герою истории нужно следить за поведением сестры и мстить за смерть матери и младшего братика."
            },
    },
    {
        id: 19,
        name: "Хантер х Хантер", 
        url: "/anime/hanter",
        release: {
            day: 17,
            month: 1,
            year: 2002,
        },
        seasons: 1,
        series: 148,
        isComing: false,
        movies: 2,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Ёсихиро Тогаси",
        texts: {
            plot: "Юноша Гон, обитающий на Китовом острове, мечтает стать Хантером, как и его отец, который бросил Гона, когда он ещё был маленьким. Эта мечта ведёт его к удивительным приключениям." 
        }
    },
    {
        id: 20,
        name: "Бездомный Бог", 
        url: "/anime/homeless",
        release: {
            day: 5,
            month: 1,
            year: 2014,
        },
        seasons: 2,
        series: 25,
        isComing: false,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "драма",
                url: "/genres/drama"
            }
        ],
        author: "Адатитока",
        texts: {
            plot: "Ято бродячий японский бог, недавно лишившийся абсолютно всего. Главный герой спустился на землю и старается сделать всё возможное, чтобы выжить. Оказывается, что каждому божественному созданию необходимы люди, верующие в него. Это прибавляет невероятное количество сил, но для Ято всё складывается слишком печально. У него нет почитателей и в добавок его бросает Мая, являющаяся его оружием. Приходится прятаться от демонов, старающихся убить любого, кто окажется на их пути." 
        }
    },
    {
        id: 21,
        name: "Семь смертных грехов", 
        url: "/anime/deadly-sins",
        release: {
            day: 5,
            month: 10,
            year: 2014,
        },
        seasons: 4,
        series: 96,
        isComing: false,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Накаба Судзуки",
        texts: {
            plot: "Земли старой Британии еще помнят древнее волшебство, в тайных местах порхают феи и водятся чудовища. Но в королевстве Лионесс главными чудищами считают Семь Смертных грехов – семерку великих воинов, что когда-то верно служили людям, а потом начали убивать, чтобы свергнуть короля и захватить власть. Орден Святых рыцарей прогнал предателей и с тех пор хранит покой королевства, но сбежавшие недобитки где-то затаились, потому орден вынужден усиливать бдительность, набирать людей и строить новые крепости." 
        }
    },
    {
        id: 22,
        name: "Класс убийц", 
        url: "/anime/assassin-class",
        release: {
            day: 10,
            month: 1,
            year: 2015,
        },
        seasons: 2,
        series: 47,
        isComing: false,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "школа",
                url: "/genres/school"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            }
        ],
        author: "Юсэй Мацуи",
        texts: {
            plot: "История данного аниме пойдет про класс 3-H, в котором классный руководитель является каким-то монстром неизвестного происхождения. И министерство обороны, поручает задание всем ученикам этого класса, избавиться это чудовище, ведь оно хочется в ближайшее время устроить апокалипсис и уничтожить все живое на планете Земля. Каждый день для ребят большее испытание, ведь они пользуюсь неисчерпаемыми запасами оружия, все время нападают на своего учителя, но тот всегда на стороже. С каждым днем их боевой дух падает все ниже и ниже, а монстр просто продолжает преподавать им предметы, выполнять свои обязанности как учитель и направлять детей к их светлому будущему. Со временем ученикам он начинает все больше нравиться, ведь другие педагоги просто отказываются от них, не воспринимая их всерьез. И теперь детям нужно сделать пожалуй самый главный их выбор, спасти весь мир или уговорить учителями не делать этого." 
        }
    },
    {
        id: 23,
        name: "Фейри Тейл", 
        url: "/anime/feiry-tale",
        release: {
            day: 12,
            month: 10,
            year: 2009,
        },
        seasons: 3,
        series: 328,
        isComing: false,
        movies: 2,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "драма",
                url: "/genres/drama"
            }
        ],
        author: "Хиро Масима",
        texts: {
            plot: "Добро пожаловать в Фиор - королевство магов и колдунов, где покой мирных жителей охраняют волшебные гильдии, выполняющие всевозможные поручения и заказы. Однако гильдия - не только способ заработка. Для многих магов это ещё и семья. В центре событий самая безбашенная гильдия континента - Хвост Феи с её славной историей и сильнейшими магами, а также дурной славой разрушителей всего и вся. Именно в эту гильдию Фейри Тейл мечтает вступить молодая заклинательница духов Люси. Судьбоносная встреча со знаменитым Нацу Драгнилом определяет дальнейшую жизнь героини и все серии в озвучке Анкорд. Её ждут невероятные приключения с Хвостом Феи - гильдией, ставшей для девушки новым домом, новой семьёй" 
        }
    },
    {
        id: 24,
        name: "Парад смерти", 
        url: "/anime/death-parade",
        release: {
            day: 9,
            month: 1,
            year: 2015,
        },
        seasons: 1,
        series: 12,
        isComing: false,
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
        ],
        author: "Юдзуру Татикава",
        texts: {
            plot: "Таких баров несколько, они разбросаны по всей планете. Один из них называется «Пятнадцать». Это мрачный и странноватый пост царства мертвых, специализирующийся на парных случаях. Т.е, если примерно в одно время умерли два человека, они являются сюда. И бармен предлагает им сыграть в занятную игру, в которой ставки нереально высоки. Что же делать, если на кон поставлена ваша жизнь? Выбора нет, приходиться играть по правилам бармена… на первый взгляд они могут показаться простыми, но в них могут оказаться ловушки. Все сделано так, чтобы играющий обнажил свою душу и показал истинную сущность. И вот тогда начнется Суд." 
        }
    },
    {
        id: 25,
        name: "Милый во Франксе", 
        url: "/anime/francse",
        release: {
            day: 13,
            month: 1,
            year: 2018,
        },
        series: 24,
        isComing: false,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "боевик",
                url: "/genres/action"
            }
        ],
        author: "Code:000",
        texts: {
            plot: "Хиро – подросток номер 016, который ранее имел славу настоящего вундеркинда. Сейчас его удалили из списка пилотов, а это означает, что продолжать жизненный путь не обязательно, так как объект выполнил свою основную функцию. Хиро понимает, что всё оборвалось в момент, когда он впервые услышал, что больше никогда не сможет сесть за управление Франкс. В этот невероятно тяжелый период главный герой неожиданно встречает загадочную и достаточно странноватую девушку, заявляющую, что она его давно искала." 
        }
    },
    {
        id: 26,
        name: "Безумный азарт", 
        url: "/anime/insane",
        release: {
            day: 1,
            month: 6,
            year: 2017,
        },
        seasons: 3,
        series: 30,
        isComing: false,
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
        ],
        author: "Кавамото Хомура",
        texts: {
            plot: "Если игрок становится победителем, значит он автоматически становится фаворитом. А вот проигравшего ждет незавидная участь. Триумфатору дается право издеваться и тиранить сраженного противника. Сопротивляться в данной ситуации бесполезно, ведь она может стать ещё печальнее. Юмэко Джабами – новенькая ученица, которая отважно приняла академические правила. Она с боевым настроем окунулась в окружающую иерархию. Всем стало понятно, что скоро Хяккао подвергнется грандиозным переменам." 
        }
    },
    {
        id: 27,
        name: "Кланнад", 
        url: "/anime/clannad",
        release: {
            day: 4,
            month: 10,
            year: 2007,
        },
        seasons: 2,
        series: 49,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "драма",
                url: "/genres/drama"
            }
        ],
        author: "Key",
        texts: {
            plot: "Выпускной, пора радоваться вступлению во взрослый мир, но для Окадзаки, это совсем нерадостное время. Судьба разочаровала, стало плевать. Трагическая гибель матери, папа мальчика опустился в пьянках, а он снискал славу отъявленного разгильдяя. Его не волнует экзамен, просто бродя он убивает время, забыв про уроки. Весной жизнь Томоя разворачивается, после встречи с девочкой, Нагису Фурукаву, она долгое время отсутствовала. Милая, странная, любит выпечку, часто разговаривает сама, одна, а её мечта вновь собрать театр. За помощью Нагисе, герой осознает - жизнь не остановилась и сердце его постепенно смягчается. Старый приятель Сунохара и «странная девочка», не одни, кто помогает оттаять Томою. Кё и Рё сестры, идущие к цели Томоя, выдающийся умом Котоми и девочка полная странностей, которая любит звезды моря и очень не самостоятельная в реальном мире.Томоя замечает, что около него вращаются жизни и судьбы многих людей и это не случайно. А ещё он разгадывает загадку своих снов – в котором ждёт его, юная девушка, чем-то похожая на него самого." 
        }
    },
    {
        id: 28,
        name: "Семья шпинонов", 
        url: "/anime/spy-femily",
        release: {
            day: 9,
            month: 4,
            year: 2022,
        },
        seasons: 1,
        series: 25,
        isComing: false,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "комедия",
                url: "/genres/comedy", 
            }
        ],
        author: "Тацуя Эндо",
        texts: {
            plot: "Над миром нависла страшная угроза! Шпиону «Сумраку» предстоит выполнить сложнейшую миссию в своей карьере… стать примерным семьянином. Под видом любящего мужа и отца он должен проникнуть в элитную школу и сблизиться с верхами мира политики. На первый взгляд прикрытие вышло великолепное, во только его жена — наёмная убийца. И супруги не знают о настоящей работе друг друга… В курсе только их приёмная дочь-телепат!" 
        },
    },
    {
        id: 29,
        name: "Берсерк", 
        url: "/anime/berserk",
        release: {
            day: 7,
            month: 10,
            year: 1997,
        },
        seasons: 4,
        series: 67,
        isComing: false,
        movies: 3,
        genres: [
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "боевик",
                url: "/genres/action"
            }
        ],
        author: "Кэнтаро Миура",
        texts: {
            plot: "Эта история по сути военная драма. Происходящая в средневековье, включает в себя хоррор перемешанный с фэнтези. В центре действий Гатс, его судьба. В прошлом наёмник, а теперь он охотится за демонами. Его путь определенный свыше. Предательство, верность, магия, темные существа и эльфы." 
        } 
    },
    {
        id: 30,
        name: "Моя геройская акедемия", 
        url: "/anime/my-academy",
        release: {
            day: 3,
            month: 4,
            year: 2016,
        },
        seasons: 6,
        series: 126,
        isComing: {
            day: 25,
            month: 3,
            year: 2023,
        },
        movies: 3,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            }
        ],
        author: "Кохэй Хорикоси",
        texts: {
            plot: "Эта история по сути военная драма. Происходящая в средневековье, включает в себя хоррор перемешанный с фэнтези. В центре действий Гатс, его судьба. В прошлом наёмник, а теперь он охотится за демонами. Его путь определенный свыше. Предательство, верность, магия, темные существа и эльфы." 
        }
    },
    {
        id: 31,
        name: "Дневник будущего", 
        url: "/anime/the-future",
        release: {
            day: 9,
            month: 10,
            year: 2011,
        },
        seasons: 1,
        series: 26,
        isComing: false,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "драма",
                url: "/genres/drama" 
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Сакаэ Эсуно",
        texts: {
            plot: "Юкитэру Амано простой четырнадцатилетний парень, учащийся в школе. Он привык постоянно всё делать самостоятельно и всю осознанную жизнь старался добиться высот. Но оказывается, что он является довольно замкнутым и не собирается меняться. Подобный образ жизни его полностью устраивает, и он безумно рад, что так происходит. Единственный, с кем он общается, это вымышленный друг по имени Деус. Он является Богом Вселенной и постоянно помогает герою справляться с различными трудностями." 
        }
    },
    {
        id: 32,
        name: "Ао Аcи", 
        url: "/anime/ashi",
        release: {
            day: 9,
            month: 4,
            year: 2022,
        },
        seasons: 1,
        series: 24,
        isComing: false,
        genres: [
            {
                name: "спорт",
                url: "/genres/sport"
            },
        ],
        author: "Дзюн Сога",
        texts: {
            plot: "В Ao Ashi мы сможем понаблюдать за становлением профессионального спортсмена, его непростым путем к цели. Однако не стоит воспринимать это чисто как спортивное аниме, здесь все необходимое для приятного и увлекательного просмотра: яркие герои, захватывающая атмосфера, шокирующие моменты, а также легкий юмор (куда же без него)." 
        }
    },
    {
        id: 33,
        name: "Дьявольские возлюбленные", 
        url: "/anime/lovers",
        release: {
            day: 16,
            month: 9,
            year: 2013,
        },
        seasons: 2,
        series: 24,
        isComing: false,
        genres: [
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
        ],
        author: "Фабрика ldea",
        texts: {
            plot: "Старшеклассница Комори Юи всегда мечтала выбраться из своего городка и поступить в другую школу. Вскоре мечта девчонки сбылась, и она отправилась в дом семьи Сакамаки, где её приютили на время обучения. Вот только в первый же день братья Сакамаки её сильно впечатлили, ведь они оказались очень странными людьми. Они всячески пытались потрогать девушку, а также вели себя дерзко и называли её своей невестой. В один из вечеров Комори узнала шокирующую правду. Оказалось, что отец отправил школьницу в особняк семьи Сакамаки не просто так. Однажды мужчина задолжал перед вампирами, и он пообещал, что отдаст им вместо долга свою симпатичную дочку. Такой поворот событий не на шутку испугал Юи, но ей всё же придётся ходить в школу вместе с братьями и жить в их особняке. Холодный и вечно показывающих безразличие Шу встретил девушку, когда она только приехала. После этого появились и другие братья, которые также имели свои особенности. Рейджи был чересчур серьёзным, а вот Аято показался нахальным вампиром. Тихоня с пугающей вежливостью Конато и вовсе наводил ужас. Самоуверенный Райто заговорил о том, что хочет испить крови Комори, но ему не позволил этого сделать Субару, так как он вечно чем-то недоволен. Юи не планировала поселяться и жить среди дерзких вампиров, но ей придётся найти с ними общий язык, а также попытаться избежать зловещих чар." 
        }
    },
    {
        id: 34,
        name: "Мастер меча онлайн", 
        url: "/anime/master-online",
        release: {
            day: 8,
            month: 7,
            year: 2012,
        },
        seasons: 3,
        series: 96,
        isComing: false,
        movies: 2,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            }
        ],
        author: "Рэки Кавахара",
        texts: {
            plot: "Представление о видеоиграх в корне изменилось с введением технологии Полного Погружения, повышающей уровень восприятия происходящего в игре до максимального и полностью перекрывающей связь с реальным миром. Данная технология применяется для создания революционной в жанре VRMMORPG игры под названием «Мастера Меча Онлайн», которая соответствует всем стандартам многопользовательских ролевых игр с одной лишь разницей в том, что игрок ощущает себя своим персонажем. Ажиотаж вокруг игры растёт столь стремительно, что на старте к серверу подключается великое множество человек. Но тут и открывается страшная тайна, скрывавшаяся за многообещающим проектом: выйти из игры невозможно, а при разрыве соединения путём избавления от шлема виртуальной реальности игрок умрёт. Единственным способом спастись создатель игры, придумавший столь хитроумную ловушку, называет полное прохождение своей VRMMORPG. В числе оказавшихся в западне виртуального пространства оказываются Кирито и Асуна, которым предстоит покорить цифровой мир и пройти испытание чувствами." 
        }
    },
    {
        id: 35,
        name: "Линия Дьявола", 
        url: "/anime/line",
        release: {
            day: 7,
            month: 4,
            year: 2018,
        },
        seasons: 1,
        series: 12,
        isComing: false,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Рё Ханада",
        texts: {
            plot: "Цукаса Тайра – очаровательная девушка, которая услышала от своей приятельницы пугающий рассказ о вампирских кланах. Она даже не подозревала, что страшная история – это не плод разбушевавшейся фантазии, а настоящая реальность. Убедиться в этом главная героиня смогла, когда произошел неожиданный случай. Однажды близкий друг Акимура прильнул устами к шее барышни, но внезапно загадочный незнакомец нарушил воцарившуюся идиллию и заявил, что парнишка виноват в гибели трех дамочек. Так девушка выяснила, что её товарищ является вампиром, который ловко маскировался и прекрасно существовал в человеческом обществе." 
        }
    },
    {
        id: 36,
        name: "В лес, где мерцают светлячки", 
        url: "/anime/fireflies",
        release: {
            day: 17,
            month: 9,
            year: 2011,
        },
        seasons: 1,
        series: 1,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "драма",
                url: "/genres/drama"
            }
        ],
        author: "Юки Мидорикава",
        texts: {
            plot: "Хотару Такэгава - маленькая девочка, живущая в большом городе Токио. Каждое лето она приезжает к дяде в деревню, чтобы отдохнуть от сигналов машин, широких улиц и шумных торговых центров. В шесть лет она заблудилась в местном лесу, и выбраться ей помог молодой человек в лисьей маске. Его зовут Гин, и ему нельзя касаться смертных, потому что на нем лежит страшное заклинание, и если нарушить его - парень исчезнет. Девочка верит ему, и вскоре они вместе находят ту часть леса, что недоступна людям, ведь именно там творятся чудеса" 
        }
    },
    {
        id: 37,
        name: "Я хочу съесть твою поджелудочную", 
        url: "/anime/pancreas",
        release: {
            day: 1,
            month: 9,
            year: 2018,
        },
        seasons: 1,
        series: 1,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "школа",
                url: "/genres/school"
            }
        ],
        author: "Сумино Ёру",
        texts: {
            plot: "Одним прекрасным днём ученик старшей школы находит чей-то личный дневник, подписанный как «Дневник Болезни». Вскоре выясняется, что дневник этот принадлежит Сакуре Ямаучи, однокласснице главного героя. Прочтя его, Харуки узнаёт, что девушка страдает смертельной болезнью — раком поджелудочной железы. Чтобы поддержать её в этой нелёгкой ситуации, юноша решает подружиться с Сакурой, несмотря на их совершенно разные характеры." 
        }
    },
    {
        id: 38,
        name: "Скейт: бесконечность", 
        url: "/anime/lnfinity",
        release: {
            day: 10,
            month: 1,
            year: 2021,
        },
        seasons: 1,
        series: 12,
        isComing: false,
        genres: [
            {
                name: "спорт",
                url: "/genres/sport"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            }
        ],
        author: "Хироко Уцуми",
        texts: {
            plot: "В шестилетнем возрасте Рэки был потрясён увиденным супергероем, а потому он решил, что в будущем станет таким сверхчеловеком. Вот только в подростковом возрасте мальчишка отрёкся от своей мечты и профессионально занялся ездой на скейте. Вскоре парнишка понял, что обычная езда не приносит ему удовольствия. Однажды Рэки попробовал внести в свою жизнь экстрим и после этого он подсел на это безумное чувство. Недавно один из лучших скейтеров узнал об опасном состязании, которое проходит в полуразрушенной шахте. Первый заезд парень проиграл, ведь он не ожидал, что соперник будет использовать запрещённые приёмы, а именно подручные предметы для победы. На следующий день юноша узнал, что в его классе появился новый ученик, которого зовут Ланга. Ребята быстро сдружились, и мастер езды на скейте предложил новоиспечённому другу прийти посмотреть на его очередное выступление в опасном турнире. Вот только вместо Рэки пришлось участвовать Ланге, который даже не умел стоять на скейте. Во время заезда зрители заметили, что новенький ездит словно профессионал. Оказалось, что юноша всю жизнь занимается сноубордом, и этот вид спорта помог выиграть ему первый заезд." 
        }
    },
    {
        id: 39,
        name: "Баскетбол Куроко", 
        url: "/anime/kuroko",
        release: {
            day: 7,
            month: 4,
            year: 2012,
        },
        seasons: 3,
        series: 76,
        isComing: false,
        movies: 4,
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "спорт",
                url: "/genres/sport"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            }
        ],
        author: "Тадатоси Фудзимаки",
        texts: {
            plot: "Все заядлые баскетболисты прекрасно знают знаменитую школу Тэйко, где есть особенный клуб, прославившийся своими грандиозными победами. Но в определенный момент пятерка выдающихся игроков разошлась по разным сторонам. Только немногие были осведомлены, что в известной команде был шестой участник (фантом), который тоже обладал поразительными способностями, но, к сожалению, оставался в тени более успешных коллег." 
        }
    },
    {
        id: 40,
        name: "Боруто", 
        url: "/anime/boruto",
        release: {
            day: 5,
            month: 4,
            year: 2017,
        },
        seasons: 1,
        series: 281,
        isComing: {
            day: 19,
            month: 2,
            year: 2023,
        },
        movies: 1,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
            
        ],
        author: "Масаси Кисимото",
        texts: {
            plot: "Встречайте новое поколение ниндзя! История Наруто подошла к концу, он исполнил свою мечту и стал Хокаге. Теперь в центре событий его сын по имени Боруто, который избрал для себя совсем иной путь. Однако для начала ему следует завести друзей и таки выпуститься из Академии, чтобы стать настоящим ниндзя. Новая история – наследие «Наруто»!" 
        }
    },
    {
        id: 41,
        name: "Доктор Стоун", 
        url: "/anime/doctor",
        release: {
            day: 5,
            month: 7,
            year: 2019,
        },
        seasons: 2,
        series: 36,
        isComing: {
            day: 5,
            month: 4,
            year: 2023,
        },
        movies: false,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Риитиро Инагаки",
        texts: {
            plot: "Типичный ученик Тайдзю Оки говорит своему любящему науку другу Сэнку, что он наконец собирается признаться Юдзурихе Огава, в которую он тайно влюблен в течение пяти лет. Встречаясь под деревом на школьной территории, внезапно небо заполнил странный яркий свет. Тайдзю толкает Юдзуриху к дереву, чтобы защитить ее, но свет внезапно окутывает все человечество и каждый человек на Земле превращается в камень. Проходит много тысячелетий и Оки выбирается из каменного плена и начинает исследовать окрестности. Тайдзю находит дерево где вырезано сообщение, которое приводит его к Сэнку, который тоже смог выбраться из каменного плена. Им предстоит выяснить, что это был за свет и почему все люди окаменели." 
        }
    },
    {
        id: 42,
        name: "Школа мертвецов", 
        url: "/anime/dead",
        release: {
            day: 5,
            month: 7,
            year: 2010,
        },
        seasons: 1,
        series: 24,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "ужасы",
                url: "/genres/horror"
            },
        ],   
        author: "Дайсукэ Сато",
        texts: {
            plot: "Ужасный вирус, превращающий простых людей в беспощадных зомби, вырывается на свободу. Страшная трагедия постепенно подбирается к частному учебному заведению Фудзими. Только немногим школьникам и преподавателям удается распознать болезнь и вовремя скрыться. Дороги счастливчиков расходятся. Такаси Комуро – семнадцатилетний парнишка, который отчаянно пытается спасти давнюю приятельницу – Рэй Миямото. В определенный момент к ребятам примыкают остальные подростки – лидер клуба кендо по имени Саэко Бусудзима, поклонник оружейной темы Кота Хирано, а также самопровозглашенный специалист Сая Такаги." 
        }
    },
    {
        id: 43,
        name: "Очень приятно Бог", 
        url: "/anime/cool-god",
        release: {
            day: 2,
            month: 10,
            year: 2012,
        },
        seasons: 2,
        series: 31,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Судзики Джульетта",
        texts: {
            plot: "Нанами Момозоно семнадцатилетняя девушка, раньше жившая обычной жизнью. Все складывалось довольно неплохо, но произошло то, что ее отец задолжал в карты крупный долг. В результате он решил просто сбежать, оставив собственную дочку одну. К ней в дом пришли неизвестные люди и просто выбросили на улицу. Главная героиня понимает, что ей необходимо срочно отыскать новое жилье. Она решает отправиться в парк и посидеть, чтобы просто подумать над ситуацией. В голове бурлят мысли, но вот она встречает молодого парня по имени Микагэ." 
        }
    },
    {
        id: 44,
        name: "Форма голоса", 
        url: "/anime/form",
        release: {
            day: 17,
            month: 9,
            year: 2016,
        },
        seasons: false,
        series: false,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "школа",
                url: "/genres/school"
            },
            {
                name: "романтика",
                url: "/genres/romance"
            }
        ],
        author: "Оойма, Ёситоки  ",
        texts: {
            plot: "Каждый человек может совершать ошибки, но не все могут это осознать, потом они испытывают стыд. Сюжет данного аниме расскажет историю о мальчике Шоя Ишида и девочки Шоко Нишимия. У девочки с детства были проблемы со слухом, и ей пришлось из-за этого много страдать. Повествование берет начало в школе, с их знакомства, маленькая Шоко переводится к Шоя. Она изначально не нравится большинству, из-за того, что отличалась от других. Тогда он принимает решение испортить ей жизнь и издевается над ней. " 
        }
    },
    {
        id: 45,
        name: "Темный дворецкий", 
        url: "/anime/butler",
        release: {
            day: 2,
            month: 10,
            year: 2008,
        },
        seasons: 3,
        series: 46,
        isComing: false,
        movies: 1,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy"
            },
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            }
        ],
        author: "Яна Тобосо",
        texts: {
            plot: "В начале весны 1889 года, в честь Королевского мандата, известный граф Сиэль Фантомхайв принимает роскошный банкет с участием нескольких непревзойденных членов высшего общества, а также изо всех сил добивающегося признания писателя, сэра Артура Конан Дойла. Однако в самый разгар званого обеда происходит ужасающее убийство, в котором подозревают никого иного, как самого Графа! Непреодолимая буря продолжает бушевать вне усадьбы. Счет убитых увеличивается. Становится очевидно, что спастись просто так не получится. Слуги Фантомхайва и именитые гости должны вместе стремиться разрешить тайну, прежде чем их также настигнет погибель. К сожалению, даже неуязвимый дворецкий Себастьян Михаэлис не застрахован от смертельной участи." 
        }
    },
    {
        id: 46,
        name: "Хоримия", 
        url: "/anime/horimiya",
        release: {
            day: 10,
            month: 1,
            year: 2021,
        },
        seasons: false,
        series: 13,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "школа",
                url: "/genres/school"
            }

        ],
        author: "Хиро",
        texts: {
            plot: "У старшеклассницы Кёко Хори, похоже, есть всё, что только можно пожелать, ведь она умница, красавица и любимица всего класса. Однако даже у идеальных на первый взгляд людей бывают секреты, и один такой есть у Хори: девушка страшно боится, что её одноклассники прознают о том, что вне стен школы она превращается в настоящую домохозяйку, на которую вечно пропадающие на работе родители скинули все домашние хлопоты и младшего брата Соту. Однажды на пороге её дома появляется незнакомец, который держит за руку поранившегося Соту… а ещё он знает Хори! Тут же выясняется, что этот парень на самом деле невзрачный одноклассник Хори, Миямура. Что же произойдёт после встречи популярной красавицы и «серой мышки»? Дружба, любовь?.. Встречайте школьную комедию, полную энергии юности!" 
        }
    },
    {
        id: 47,
        name: "Магистр дьявольского культа", 
        url: "/anime/master",
        release: {
            day: 9,
            month: 7,
            year: 2018,
        },
        seasons: 3,
        series: 35,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure"
            },
            {
                name: "боевик",
                url: "/genres/action" 
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            }
        ],
        author: "Мосян Тунсю",
        texts: {
            plot: "Мусюанью ненавидят абсолютно все. Он – внебрачный ребенок, которого окружающие считают безумцем из-за особого увлечения темными ритуалами. В определенный момент, погрузившись в очередной эксперимент, парень вызывает призрака могущественного чародея Вусьена, который вселяется в него. В былые времена маг имел дурную славу и был знаменит своей жестокостью и хладнокровием. Колдун всегда продвигался к поставленной цели, не обращая внимания на возникающие препятствия. Он был готов использовать любые методы, даже если они приводили к смерти родных. Очутившись в теле юноши, злой волшебник обязан исполнить его желание, чтобы получить заветную свободу." 
        }
    },
    {
        id: 48,
        name: "Благословение небожителей ", 
        url: "/anime/blogging",
        release: {
            day: 31,
            month: 10,
            year: 2020,
        },
        seasons: 1,
        series: 12,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "приключение",
                url: "/genres/adventure" 
            },
            {
                name: "драма",
                url: "/genres/drama"
            }
        ],
        author: "Мосян Тунсю",
        texts: {
            plot: "Восемь веков назад Лянь Се был наследным принцем прославленного королевства, его любили простые жители и уважали равные по положению. Так что неудивительно, что он, будучи ещё совсем юным, взошёл на Небеса и занял место среди бессмертных небожителей. Однако надолго Лянь Се там не задержался, он глазом не успел моргнуть, как его изгнали обратно в мир смертных.И вот спустя восемьсот лет Лянь Се, ставший уже предметом для насмешек, предпринимает очередную (уже третью по счёту) попытку вернуться на Небеса. Вновь став богом, Лянь Се получает первое задание, выполняя которое, сталкивается с таинственным демоном, имеющим к нему совсем не праздный интерес. Что нужно этому демону от Лянь Се? И удастся ли тому не опростоволоситься и остаться наконец на Небесах?" 
        }
    },
    {
        id: 49,
        name: "Один на вылет", 
        url: "/anime/departure",
        release: {
            day: 1,
            month: 10,
            year: 2008,
        },
        seasons: 1,
        series: 25,
        isComing: false,
        genres: [
            {
                name: "спорт",
                url: "/genres/sport"
            }, 
        ],
        author: "Синобу Кайтани",
        texts: {
            plot: "Хиромичи Коджима он ведущий бэттер в профессиональной команде бейсболистов. Его верный питчер Наканэ и тренер устроили тренировочный лагерь на Акинаве. С тех пор как Коджима 21 год назад присоединился к Лекоонсу, он завоевал звание — новичок года. Но за всю карьеру бейсболиста Коджима ни разу не выиграл ни одного чемпионата, из-за чего остальные его считают невезучим гением бэттера. Для победы ему не хватает какого-то недостающего звена, и организованный лагерь был чтобы найти его. И именно здесь Коджима встретит именно его — Тоа Токучи — гений питчер.Кадры" 
        }
    },
    {
        id: 50,
        name: "Демоны старшый школы", 
        url: "/anime/older",
        release: {
            day: 6,
            month: 9,
            year: 2012,
        },
        seasons: 4,
        series: 52,
        isComing: false,
        movies: false,
        genres: [
            {
                name: "драма",
                url: "/genres/drama"
            },
            {
                name: "романтика",
                url: "/genres/romance"
            },
            {
                name: "комедия",
                url: "/genres/comedy",
            },
            {
                name: "боевик",
                url: "/genres/action"
            },
            {
                name: "фэнтези",
                url: "/genres/fantasy"
            },
            {
                name: "приключение",
                url: "/genres/adventure"
            }
        ],
        author: "Итиэй Исибуми",
        texts: {
            plot: "Согласно сюжету ранобэ, демоны с древних времен сражались за контроль над Подземным миром с изгнанными с Небес падшими ангелами. Кроме того, их общим врагом выступали ангелы, посылаемые библейским Богом против обеих рас, населяющих Подземный мир. В ходе Великой войны трёх фракций все три стороны понесли огромные потери. В частности, в ходе войны были убиты «Четыре великие владыки демонов» и библейский Бог. Из-за этого несколько сотен лет назад враждующие стороны были вынуждены прекратить войну, так и не определив победителя. Однако отношения между сторонами по-прежнему оставались напряжёнными. В связи с огромными потерями среди населения, демоны стали перерождать существ иных рас как демонов. Каждый перерождённый становился слугой превратившего его демона. Дабы стимулировать новых демонов к саморазвитию, была введена Рейтинговая игра, где демоны и их кланы могут демонстрировать свою силу и повышаться в ранге." 
        }
    }

]

module.exports = {
    animes,
    allAnime
}